Week7/E_ExtraCases/waterChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       22800;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       23000;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       24600;
    }
    atmosphere
    {
        type            patch;
        nFaces          400;
        startFace       24800;
    }
)

// ************************************************************************* //
